ahtn/keyplus/ports/efm8/efm8/mcu/C8051F850/inc/SI_C8051F850_Register_Enums.h
#define CPT0MD_CPLOUT__BMASK            0x80 ///< Comparator Latched Output Flag              
#define CPT0MD_CPLOUT__SHIFT            0x07 ///< Comparator Latched Output Flag              
#define CPT0MD_CPLOUT__LOW              0x00 ///< Comparator output was logic low at last PCA 
                                             ///< overflow.                                   
#define CPT0MD_CPLOUT__HIGH             0x80 ///< Comparator output was logic high at last PCA
                                             ///< overflow.                                   
                                                                                              
//------------------------------------------------------------------------------
// CPT0MX Enums (Comparator 0 Multiplexer Selection @ 0x9F)
//------------------------------------------------------------------------------
#define CPT0MX_CMXP__FMASK    0x0F ///< Comparator Positive Input MUX Selection
#define CPT0MX_CMXP__SHIFT    0x00 ///< Comparator Positive Input MUX Selection
#define CPT0MX_CMXP__CMP0P0   0x00 ///< External pin CMP0P.0.                  
#define CPT0MX_CMXP__CMP0P1   0x01 ///< External pin CMP0P.1.                  
#define CPT0MX_CMXP__CMP0P2   0x02 ///< External pin CMP0P.2.                  
#define CPT0MX_CMXP__CMP0P3   0x03 ///< External pin CMP0P.3.                  
#define CPT0MX_CMXP__CMP0P4   0x04 ///< External pin CMP0P.4.                  
#define CPT0MX_CMXP__CMP0P5   0x05 ///< External pin CMP0P.5.                  
#define CPT0MX_CMXP__CMP0P6   0x06 ///< External pin CMP0P.6.                  
#define CPT0MX_CMXP__CMP0P7   0x07 ///< External pin CMP0P.7.                  
#define CPT0MX_CMXP__INTERNAL 0x08 ///< Internal LDO output                    
#define CPT0MX_CMXP__NONE     0x0F ///< No input selected.                     
                                                                               
#define CPT0MX_CMXN__FMASK    0xF0 ///< Comparator Negative Input MUX Selection
#define CPT0MX_CMXN__SHIFT    0x04 ///< Comparator Negative Input MUX Selection
#define CPT0MX_CMXN__CMP0N0   0x00 ///< External pin CMP0N.0.                  
#define CPT0MX_CMXN__CMP0N1   0x10 ///< External pin CMP0N.1.                  
#define CPT0MX_CMXN__CMP0N2   0x20 ///< External pin CMP0N.2.                  
#define CPT0MX_CMXN__CMP0N3   0x30 ///< External pin CMP0N.3.                  
#define CPT0MX_CMXN__CMP0N4   0x40 ///< External pin CMP0N.4.                  
#define CPT0MX_CMXN__CMP0N5   0x50 ///< External pin CMP0N.5.                  
#define CPT0MX_CMXN__CMP0N6   0x60 ///< External pin CMP0N.6.                  
#define CPT0MX_CMXN__CMP0N7   0x70 ///< External pin CMP0N.7.                  
#define CPT0MX_CMXN__GND      0x80 ///< GND                                    
#define CPT0MX_CMXN__NONE     0xF0 ///< No input selected.                     
                                                                               
//------------------------------------------------------------------------------
// CPT1CN Enums (Comparator 1 Control @ 0xBF)
//------------------------------------------------------------------------------
#define CPT1CN_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control            
#define CPT1CN_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control            
#define CPT1CN_CPHYN__DISABLED             0x00 ///< Disable negative hysteresis.                      
#define CPT1CN_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.               
#define CPT1CN_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.               
#define CPT1CN_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                       
#define CPT1CN_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control            
#define CPT1CN_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control            
#define CPT1CN_CPHYP__DISABLED             0x00 ///< Disable positive hysteresis.                      
#define CPT1CN_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.               
#define CPT1CN_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.               
#define CPT1CN_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).     
                                                                                                       
#define CPT1CN_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag                      
#define CPT1CN_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag                      
#define CPT1CN_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                ///< flag was last cleared.                            
#define CPT1CN_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.             
                                                                                                       
#define CPT1CN_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CPT1CN_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CPT1CN_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                ///< flag was last cleared.                            
#define CPT1CN_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                       
#define CPT1CN_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.                           
#define CPT1CN_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.                           
                                                                                                       
#define CPT1CN_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CPT1CN_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CPT1CN_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CPT1CN_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                       
//------------------------------------------------------------------------------
// CPT1MD Enums (Comparator 1 Mode @ 0xAB)
//------------------------------------------------------------------------------
#define CPT1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CPT1MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CPT1MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CPT1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CPT1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CPT1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CPT1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CPT1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
