ahtn/keyplus/ports/efm8/efm8/mcu/C8051F850/inc/SI_C8051F850_Register_Enums.h
#define CPT1MD_CPLOUT__BMASK            0x80 ///< Comparator Latched Output Flag              
#define CPT1MD_CPLOUT__SHIFT            0x07 ///< Comparator Latched Output Flag              
#define CPT1MD_CPLOUT__LOW              0x00 ///< Comparator output was logic low at last PCA 
                                             ///< overflow.                                   
#define CPT1MD_CPLOUT__HIGH             0x80 ///< Comparator output was logic high at last PCA
                                             ///< overflow.                                   
                                                                                              
//------------------------------------------------------------------------------
// CPT1MX Enums (Comparator 1 Multiplexer Selection @ 0xAA)
//------------------------------------------------------------------------------
#define CPT1MX_CMXP__FMASK    0x0F ///< Comparator Positive Input MUX Selection
#define CPT1MX_CMXP__SHIFT    0x00 ///< Comparator Positive Input MUX Selection
#define CPT1MX_CMXP__CMP1P0   0x00 ///< External pin CMP1P.0.                  
#define CPT1MX_CMXP__CMP1P1   0x01 ///< External pin CMP1P.1.                  
#define CPT1MX_CMXP__CMP1P2   0x02 ///< External pin CMP1P.2.                  
#define CPT1MX_CMXP__CMP1P3   0x03 ///< External pin CMP1P.3.                  
#define CPT1MX_CMXP__CMP1P4   0x04 ///< External pin CMP1P.4.                  
#define CPT1MX_CMXP__CMP1P5   0x05 ///< External pin CMP1P.5.                  
#define CPT1MX_CMXP__CMP1P6   0x06 ///< External pin CMP1P.6.                  
#define CPT1MX_CMXP__CMP1P7   0x07 ///< External pin CMP1P.7.                  
#define CPT1MX_CMXP__INTERNAL 0x08 ///< Internal LDO output                    
#define CPT1MX_CMXP__NONE     0x0F ///< No input selected.                     
                                                                               
#define CPT1MX_CMXN__FMASK    0xF0 ///< Comparator Negative Input MUX Selection
#define CPT1MX_CMXN__SHIFT    0x04 ///< Comparator Negative Input MUX Selection
#define CPT1MX_CMXN__CMP1N0   0x00 ///< External pin CMP1N.0.                  
#define CPT1MX_CMXN__CMP1N1   0x10 ///< External pin CMP1N.1.                  
#define CPT1MX_CMXN__CMP1N2   0x20 ///< External pin CMP1N.2.                  
#define CPT1MX_CMXN__CMP1N3   0x30 ///< External pin CMP1N.3.                  
#define CPT1MX_CMXN__CMP1N4   0x40 ///< External pin CMP1N.4.                  
#define CPT1MX_CMXN__CMP1N5   0x50 ///< External pin CMP1N.5.                  
#define CPT1MX_CMXN__CMP1N6   0x60 ///< External pin CMP1N.6.                  
#define CPT1MX_CMXN__CMP1N7   0x70 ///< External pin CMP1N.7.                  
#define CPT1MX_CMXN__GND      0x80 ///< GND                                    
#define CPT1MX_CMXN__NONE     0xF0 ///< No input selected.                     
                                                                               
//------------------------------------------------------------------------------
// CRC0AUTO Enums (CRC0 Automatic Control @ 0xD2)
//------------------------------------------------------------------------------
#define CRC0AUTO_CRCST__FMASK     0x3F ///< Automatic CRC Calculation Starting Block  
#define CRC0AUTO_CRCST__SHIFT     0x00 ///< Automatic CRC Calculation Starting Block  
                                                                                      
#define CRC0AUTO_AUTOEN__BMASK    0x80 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__SHIFT    0x07 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__DISABLED 0x00 ///< Disable automatic CRC operations on flash.
#define CRC0AUTO_AUTOEN__ENABLED  0x80 ///< Enable automatic CRC operations on flash. 
                                                                                      
//------------------------------------------------------------------------------
// CRC0CN Enums (CRC0 Control @ 0xCE)
//------------------------------------------------------------------------------
#define CRC0CN_CRCPNT__BMASK        0x01 ///< CRC Result Pointer                               
#define CRC0CN_CRCPNT__SHIFT        0x00 ///< CRC Result Pointer                               
#define CRC0CN_CRCPNT__ACCESS_LOWER 0x00 ///< CRC0DAT accesses bits 7-0 of the 16-bit CRC      
                                         ///< result.                                          
#define CRC0CN_CRCPNT__ACCESS_UPPER 0x01 ///< CRC0DAT accesses bits 15-8 of the 16-bit CRC     
                                         ///< result.                                          
                                                                                               
#define CRC0CN_CRCVAL__BMASK        0x04 ///< CRC Initialization Value                         
#define CRC0CN_CRCVAL__SHIFT        0x02 ///< CRC Initialization Value                         
#define CRC0CN_CRCVAL__SET_ZEROES   0x00 ///< CRC result is set to 0x0000 on write of 1 to     
                                         ///< CRCINIT.                                         
#define CRC0CN_CRCVAL__SET_ONES     0x04 ///< CRC result is set to 0xFFFF on write of 1 to     
                                         ///< CRCINIT.                                         
                                                                                               
#define CRC0CN_CRCINIT__BMASK       0x08 ///< CRC Initialization Enable                        
#define CRC0CN_CRCINIT__SHIFT       0x03 ///< CRC Initialization Enable                        
#define CRC0CN_CRCINIT__DO_NOT_INIT 0x00 ///< Do not initialize the CRC result.                
#define CRC0CN_CRCINIT__INIT        0x08 ///< Initialize the CRC result to ones or zeroes vased
                                         ///< on the value of CRCVAL.                          
                                                                                               
//------------------------------------------------------------------------------
// CRC0CNT Enums (CRC0 Automatic Flash Sector Count @ 0xD3)
//------------------------------------------------------------------------------
#define CRC0CNT_CRCCNT__FMASK  0x1F ///< Automatic CRC Calculation Block Count
#define CRC0CNT_CRCCNT__SHIFT  0x00 ///< Automatic CRC Calculation Block Count
                                                                              
#define CRC0CNT_CRCDN__BMASK   0x80 ///< Automatic CRC Calculation Complete   
#define CRC0CNT_CRCDN__SHIFT   0x07 ///< Automatic CRC Calculation Complete   
#define CRC0CNT_CRCDN__NOT_SET 0x00 ///< A CRC calculation is in progress.    
#define CRC0CNT_CRCDN__SET     0x80 ///< A CRC calculation is not in progress.
                                                                              
//------------------------------------------------------------------------------
// CRC0DAT Enums (CRC0 Data Output @ 0xDE)
//------------------------------------------------------------------------------
#define CRC0DAT_CRC0DAT__FMASK 0xFF ///< CRC Data Output
#define CRC0DAT_CRC0DAT__SHIFT 0x00 ///< CRC Data Output
                                                        
//------------------------------------------------------------------------------
// CRC0FLIP Enums (CRC0 Bit Flip @ 0xCF)
//------------------------------------------------------------------------------
#define CRC0FLIP_CRC0FLIP__FMASK 0xFF ///< CRC0 Bit Flip
#define CRC0FLIP_CRC0FLIP__SHIFT 0x00 ///< CRC0 Bit Flip
                                                        
//------------------------------------------------------------------------------
// CRC0IN Enums (CRC0 Data Input @ 0xDD)
//------------------------------------------------------------------------------
#define CRC0IN_CRC0IN__FMASK 0xFF ///< CRC Data Input
#define CRC0IN_CRC0IN__SHIFT 0x00 ///< CRC Data Input
                                                     
//------------------------------------------------------------------------------
// DERIVID Enums (Derivative Identification @ 0xAD)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK        0xFF ///< Derivative ID
#define DERIVID_DERIVID__SHIFT        0x00 ///< Derivative ID
#define DERIVID_DERIVID__C8051F850_GU 0xD0 ///< C8051F850-GU 
#define DERIVID_DERIVID__C8051F851_GU 0xD1 ///< C8051F851-GU 
#define DERIVID_DERIVID__C8051F852_GU 0xD2 ///< C8051F852-GU 
#define DERIVID_DERIVID__C8051F853_GU 0xD3 ///< C8051F853-GU 
#define DERIVID_DERIVID__C8051F854_GU 0xD4 ///< C8051F854-GU 
#define DERIVID_DERIVID__C8051F855_GU 0xD5 ///< C8051F855-GU 
#define DERIVID_DERIVID__C8051F860_GS 0xE0 ///< C8051F860-GS 
#define DERIVID_DERIVID__C8051F861_GS 0xE1 ///< C8051F861-GS 
#define DERIVID_DERIVID__C8051F862_GS 0xE2 ///< C8051F862-GS 
#define DERIVID_DERIVID__C8051F863_GS 0xE3 ///< C8051F863-GS 
#define DERIVID_DERIVID__C8051F864_GS 0xE4 ///< C8051F864-GS 
#define DERIVID_DERIVID__C8051F865_GS 0xE5 ///< C8051F865-GS 
#define DERIVID_DERIVID__C8051F850_GM 0xF0 ///< C8051F850-GM 
#define DERIVID_DERIVID__C8051F851_GM 0xF1 ///< C8051F851-GM 
#define DERIVID_DERIVID__C8051F852_GM 0xF2 ///< C8051F852-GM 
#define DERIVID_DERIVID__C8051F853_GM 0xF3 ///< C8051F853-GM 
#define DERIVID_DERIVID__C8051F854_GM 0xF4 ///< C8051F854-GM 
#define DERIVID_DERIVID__C8051F855_GM 0xF5 ///< C8051F855-GM 
                                                             
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xB5)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xB6)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A 
#define REVID_REVID__REV_B 0x01 ///< Revision B 
#define REVID_REVID__REV_C 0x02 ///< Revision C 
                                                
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
